{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "name": "cropping2d_2", "cropping": [[22, 0], [0, 0]], "trainable": true}}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u001f\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000|\u0001\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000d\u0004\u0000\u0083\u0002\u0000S)\u0005N\u00e9\u0000\u0000\u0000\u0000\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000)\u0002r\u0002\u0000\u0000\u0000r\u0003\u0000\u0000\u0000)\u0003\u00da\ntensorflow\u00da\u0005image\u00da\rresize_images)\u0002r\u0005\u0000\u0000\u0000\u00da\u0002tf\u00a9\u0000r\b\u0000\u0000\u0000\u00fa\u001f<ipython-input-16-04c314310536>\u00da\u0006resize\f\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", null, null], "name": "lambda_3", "output_shape": null, "output_shape_type": "raw", "trainable": true, "arguments": {}, "function_type": "lambda"}}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-16-04c314310536>\u00da\b<lambda>\u0012\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_4", "output_shape": null, "output_shape_type": "raw", "trainable": true, "arguments": {}, "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "subsample": [2, 2], "nb_filter": 24, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "name": "convolution2d_6", "activation": "relu", "nb_row": 5, "nb_col": 5, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "subsample": [2, 2], "nb_filter": 36, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "name": "convolution2d_7", "activation": "relu", "nb_row": 5, "nb_col": 5, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "subsample": [2, 2], "nb_filter": 48, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "name": "convolution2d_8", "activation": "relu", "nb_row": 5, "nb_col": 5, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "name": "convolution2d_9", "activation": "relu", "nb_row": 3, "nb_col": 3, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "name": "convolution2d_10", "activation": "relu", "nb_row": 3, "nb_col": 3, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 100, "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "name": "dense_5", "trainable": true, "b_constraint": null, "input_dim": 1152, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"output_dim": 50, "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "name": "dense_6", "trainable": true, "b_constraint": null, "input_dim": 100, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"output_dim": 10, "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "name": "dense_7", "trainable": true, "b_constraint": null, "input_dim": 50, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1, "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "name": "dense_8", "trainable": true, "b_constraint": null, "input_dim": 10, "b_regularizer": null, "W_regularizer": null}}]}